app/Controllers/ProductosController.php

    public function index($validar=null) {

        $data = [
            'validation' => $validar,
            'listarProductos' =>  $this->productos->where('estado',1)->findAll()
---
SELECT *
FROM `productos`
WHERE `estado` = 1

    public function actualizar($id=null){
        if ($this->request->getMethod() === 'get' ) {

            $data = ['datosEditar'=> $this->productos->where('id',$id)->first()];
---
SELECT *
FROM `productos`
WHERE `id` = '3'
 LIMIT 1